#### Making example of dataframe

In [6]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "메뉴":['아메리카노', '카페라떼', '에스프레소', '카페모카', '바닐라라떼'],
    "가격":[4500, 5000, 4000, 5900, 5300],
    "칼로리":[10, 110, np.NaN, 210, np.NaN],
    "원두":['과테말라', '브라질', '과테말라', np.NaN, np.NaN]
})
df

      메뉴    가격    칼로리    원두
0  아메리카노  4500   10.0  과테말라
1   카페라떼  5000  110.0   브라질
2  에스프레소  4000    NaN  과테말라
3   카페모카  5900  210.0   NaN
4  바닐라라떼  5300    NaN   NaN

#### Q1 Fill missing value of "calorie" with min of calorie

In [7]:
df['칼로리'] = df['칼로리'].fillna(min(df['칼로리']))

In [10]:
min(df['칼로리']) == df['칼로리'].min()

True

In [19]:
df

      메뉴    가격    칼로리    원두
0  아메리카노  4500   10.0  과테말라
1   카페라떼  5000  110.0   브라질
2  에스프레소  4000   10.0  과테말라
3   카페모카  5900  210.0  과테말라
4  바닐라라떼  5300   10.0  과테말라

#### Q2 Fill missing value of "coffee beans" with mode of coffee beans

In [17]:
df['원두'] = df['원두'].fillna(df['원두'].mode()[0])

In [16]:
df['원두'].mode()[0]

'과테말라'

In [18]:
df

      메뉴    가격    칼로리    원두
0  아메리카노  4500   10.0  과테말라
1   카페라떼  5000  110.0   브라질
2  에스프레소  4000   10.0  과테말라
3   카페모카  5900  210.0  과테말라
4  바닐라라떼  5300   10.0  과테말라

#### Q3 Counting number of price over 5000

In [27]:
(df['가격'] >= 5000).sum()

3

#### Q4 Making "event" column and fill with 50% off the cover price

In [28]:
df['이벤트가'] = df['가격'] // 2

In [29]:
df

      메뉴    가격    칼로리    원두  이벤트가
0  아메리카노  4500   10.0  과테말라  2250
1   카페라떼  5000  110.0   브라질  2500
2  에스프레소  4000   10.0  과테말라  2000
3   카페모카  5900  210.0  과테말라  2950
4  바닐라라떼  5300   10.0  과테말라  2650

#### Q5 Delete "Calorie" column

In [35]:
df = df.drop('칼로리', axis = 1)

In [36]:
df

      메뉴    가격    원두  이벤트가
0  아메리카노  4500  과테말라  2250
1   카페라떼  5000   브라질  2500
2  에스프레소  4000  과테말라  2000
3   카페모카  5900  과테말라  2950
4  바닐라라떼  5300  과테말라  2650

#### Q6 Choose top of 3 column (using loc)

In [38]:
df.loc[:2]

      메뉴    가격    원두  이벤트가
0  아메리카노  4500  과테말라  2250
1   카페라떼  5000   브라질  2500
2  에스프레소  4000  과테말라  2000

#### Q7 Choose top of 3 columns (using iloc)

In [41]:
df.iloc[:3]

      메뉴    가격    원두  이벤트가
0  아메리카노  4500  과테말라  2250
1   카페라떼  5000   브라질  2500
2  에스프레소  4000  과테말라  2000

#### Differences with loc and iloc

- iloc: Integer Location
- loc: location
- you can use 'iloc' when you know index number of data.
- you can use 'loc' when you know name of data.
- When you use [:3] function loc and iloc, result of each function is 4 and 3.